{
    "title": "GhostShell: Streaming LLM Function Calls for Concurrent Embodied Programming",
    "authorList":[
        {
            "name": "Jian Gong",
            "url": ""
        },
        {
            "name": "Youwei Huang",
            "url": "https://www.devil.ren"
        },
        {
            "name": "Bo Yuan",
            "url": ""
        },
        {
            "name": "Ming Zhu",
            "url": ""
        },
        {
            "name": "Zhou Liao",
            "url": ""
        },
        {
            "name": "Jianhang Liang",
            "url": ""
        },
        {
            "name": "Juncheng Zhan",
            "url": ""
        },
        {
            "name": "Jinke Wang",
            "url": ""
        },
        {
            "name": "Hang Shu",
            "url": ""
        },
        {
            "name": "Mingyue Xiong",
            "url": ""
        },
        {
            "name": "Yanjun Ye",
            "url": ""
        },
        {
            "name": "Yufan Zu",
            "url": ""
        },
        {
            "name": "Yang Zhou",
            "url": ""
        },
        {
            "name": "Yihan Ding",
            "url": ""
        },
        {
            "name": "Xuannian Chen",
            "url": ""
        },
        {
            "name": "Xingyu Lu",
            "url": ""
        },
        {
            "name": "Runjie Ban",
            "url": ""
        },
        {
            "name": "Bingchao Huang",
            "url": ""
        },
        {
            "name": "Fusen Liu",
            "url": ""
        }
    ],
    "linkList":[
        {
            "name": "Paper",
            "img": "./img/paper_small.png",
            "url": "https://arxiv.org/abs/2508.05298"
        },
        {
            "name": "Code",
            "img": "./img/github.png",
            "url": "https://github.com/Coco-Robot/GhostShell"
        }
    ],
    "abstract": "We present <strong>GhostShell</strong>, a novel approach that leverages Large Language Models (LLMs) to enable streaming and concurrent behavioral programming for embodied systems. In contrast to conventional methods that rely on pre-scheduled action sequences or behavior trees, <strong>GhostShell</strong> drives embodied systems to act on-the-fly by issuing function calls incrementally as tokens are streamed from the LLM. <strong>GhostShell</strong> features a streaming XML function token parser, a dynamic function interface mapper, and a multi-channel scheduler that orchestrates intra-channel synchronous and inter-channel asynchronous function calls, thereby coordinating serial-parallel embodied actions across multiple robotic components under LLM guidance. We evaluate <strong>GhostShell</strong> on our robotic prototype COCO through comprehensive grounded experiments across 34 real-world interaction tasks and multiple LLM backends. The results demonstrate that our approach achieves a state-of-the-art Behavioral Correctness Metric of 0.85 with Claude-4-Sonnet, and up to 66X faster response times compared to native LLM function calling APIs. <strong>GhostShell</strong> also proves effective in long-horizon multimodal tasks, exhibiting strong robustness and generalization capabilities.",
    "mainImg": "./img/framework.png",
    "ExperimentText1":"Below are some demonstration videos of experiments. The videos not only include actions, but also the voice and expressions of the robot.",
    "ExperimentText2":"We also place the XML function tokens generated by LLM at the bottom of the video. The robot completes tasks by executing these functions.",
    "paperUrl":"https://arxiv.org/abs/2508.05298",
    "citationContent":"@article{gong2025ghostshell,<p class='indent-8'> title={GhostShell: Streaming LLM Function Calls for Concurrent Embodied Programming},</p> <p class='indent-8'>author={Gong, Jian and Huang, Youwei and Yuan, Bo and Zhu, Ming and Zhan, Juncheng and Wang, Jinke and Shu, Hang and Xiong, Mingyue and Ye, Yanjun and Zu, Yufan and others},</p><p class='indent-8'> journal={arXiv preprint arXiv:2508.05298},</p><p class='indent-8'> year={2025}</p>}",
    "acknowledgementsContent": "The name of our approach pays tribute to the science fiction work Ghost in the Shell by Masamune Shirow.  We appreciate all those who strive to turn science fiction into reality"
}
